tap "aws/tap"
tap "fluxcd/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "act"                  # Act is a CLI for testing github actions
brew "automake"             # GNU automake utility program
brew "pkg-config"           # helper tool used when compiling applications and librarie
brew "coreutils"            # GNU File, Shell, and Text utilities
brew "go"                   # Go programming lanuage and compiler
brew "dep"                  # Golang Dependency management tool
brew "libtool"              # generic library support script that hides the complexity of using shared libraries behind a consistent, portable interface
brew "gcc"                  # GNU Compiler Collection
brew "gh"                   # GitHub CLI
brew "git"                  # Git command line interface
brew "helmfile"             # Helmfile is a tool for managing Helm charts
brew "htop"                 # Interactive process viewer
brew "jq"                   # Command-line JSON processor
brew "k9s"                  # Kubernetes CLI
brew "kubernetes-cli"       # Kubernetes CLI
brew "kustomize"            # Kustomize is a tool for managing kubernetes manifests
brew "mkcert"               # mkcert is a tool for generating certificates
brew "nvm"                  # Node Version Manager
brew "postgresql"           # PostgreSQL database system and client
brew "protoc-gen-go"        # protoc-gen-go is a plugin for the Google protocol buffer compiler
brew "qrencode"             # QR Code generation
brew "sops"                 # Encrypted file editor
brew "swagger-codegen"      # Swagger Codegen is a tool for generating client libraries from OpenAPI specifications
brew "terraform"            # Terraform is a tool for building, changing, and versioning infrastructure
brew "thefuck"              # possibly the most important tool, corrects errors in a terminal
brew "tmux"                 # Tmux is a terminal multiplexer
brew "tree"                 # Tree is a directory listing program
brew "vim"                  # Vim is a highly configurable text editor
brew "wget"                 # wget is a command line file downloader
brew "zlib"                 # zlib is a general-purpose compression library
brew "zsh-autosuggestions"  # zsh-autosuggestions is a plugin for zsh to provide autosuggestions
brew "aws/tap/aws-sam-cli"  # AWS SAM CLI
brew "fluxcd/tap/flux"      # Flux is a command line tool for managing fluxcd, the kubernetes CI/CD tool
cask "docker"               # Docker container management
cask "firefox"              # Firefox web browser
cask "firefox-developer-edition"  # Firefox developer edition
cask "font-fira-code"       # Fira Code is a monospace font with a large set of characters
cask "hyper"                # Hyper is a terminal UI for macOS written in electron
cask "microsoft-teams"      # Microsoft Teams is a collaboration tool for teams
cask "postman"              # Postman is a tool for API development and testing
cask "slack"                # Slack is a cloud-based set of tools for team communication and collaboration
cask "spectacle"            # Spectacle is a utility for snapping windows around your screen
cask "the-unarchiver"       # Better archive extraction
cask "vagrant"              # Vagrant is a tool for building and managing virtual machines
cask "visual-studio-code"   # IDE for programming and designing code